<a href="https://colab.research.google.com/github/hieubkset/Colab-Notebooks/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Học Pandas trong 5 phút

![pandas](https://1.bp.blogspot.com/-TFpGqKhrhe0/WTImZqTY2fI/AAAAAAAADmk/T-ieF0Cm9cAsYCuOKflQmnWYrdTqHMmUgCLcB/s400/pandas.png)

[Pandas](https://pandas.pydata.org/) là một thư viện cung cấp các hàm dùng để đọc, ghi, thao tác với tệp csv - một loại tệp tương tự như Excel. 

Tệp csv được dùng để lưu các thông tin theo hàng vào cột. Trong đó, mỗi cột là một trường thông tin, mỗi hàng là một bản ghi. Một ví dụ về tệp csv như sau:

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>person_ID</th>
      <th>name</th>
      <th>first</th>
      <th>last</th>
      <th>middle</th>
      <th>email</th>
      <th>phone</th>
      <th>fax</th>
      <th>title</th>
      <th>age</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>3130</td>
      <td>Burks, Rosella</td>
      <td>Rosella</td>
      <td>Burks</td>
      <td>NaN</td>
      <td>BurksR@univ.edu</td>
      <td>963.555.1253</td>
      <td>963.777.4065</td>
      <td>Professor</td>
      <td>41</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3297</td>
      <td>Avila, Damien</td>
      <td>Damien</td>
      <td>Avila</td>
      <td>NaN</td>
      <td>AvilaD@univ.edu</td>
      <td>963.555.1352</td>
      <td>963.777.7914</td>
      <td>Professor</td>
      <td>49</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3547</td>
      <td>Olsen, Robin</td>
      <td>Robin</td>
      <td>Olsen</td>
      <td>NaN</td>
      <td>OlsenR@univ.edu</td>
      <td>963.555.1378</td>
      <td>963.777.9262</td>
      <td>Assistant Professor</td>
      <td>48</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1538</td>
      <td>Moises, Edgar Estes</td>
      <td>Edgar</td>
      <td>Moises</td>
      <td>Estes</td>
      <td>MoisesE@univ.edu</td>
      <td>963.555.2731x3565</td>
      <td>963.777.8264</td>
      <td>Professor</td>
      <td>38</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2941</td>
      <td>Brian, Heath Pruitt</td>
      <td>Heath</td>
      <td>Brian</td>
      <td>Pruitt</td>
      <td>BrianH@univ.edu</td>
      <td>963.555.2800</td>
      <td>963.777.7249</td>
      <td>Associate Curator</td>
      <td>38</td>
    </tr>
  </tbody>
</table>

Tệp csv thường được dùng trong Machine Learning như lưu trữ dataset hoặc để lưu dự đoán của model. Một ví dụ sử dụng tệp csv trên [Kaggle](https://www.kaggle.com/c/digit-recognizer/data).

Trong bài này, chúng ta sẽ tìm hiểu cách làm việc với tệp csv sử dụng Pandas.

## Khai báo thư viện

In [0]:
import pandas as pd

## 1. Đọc một tệp csv

In [0]:
people_df = pd.read_csv('people.csv', encoding='utf-8', header=0, sep=',')

Sử dụng hàm `pd.read_csv` và truyền vào các tham số:

+ địa chỉ tệp csv
+ encoding: mặc định là 'utf-8'
+ header: số thứ tự của hàng header
+ sep: cho biết cách các trường dữ liệu được ngăn cách

Ví dụ về nội dung của một tệp csv:

In [0]:
person_ID,name,first,last,middle,email,phone,fax,title,age
3130,"Burks, Rosella ",Rosella,Burks,,BurksR@univ.edu,963.555.1253,963.777.4065,Professor ,41
3297,"Avila, Damien ",Damien,Avila,,AvilaD@univ.edu,963.555.1352,963.777.7914,Professor ,49
3547,"Olsen, Robin ",Robin,Olsen,,OlsenR@univ.edu,963.555.1378,963.777.9262,Assistant Professor,48
1538,"Moises, Edgar Estes",Edgar,Moises,Estes,MoisesE@univ.edu,963.555.2731x3565,963.777.8264,Professor,38
2941,"Brian, Heath Pruitt",Heath,Brian,Pruitt,BrianH@univ.edu,963.555.2800,963.777.7249,Associate Curator ,38

Dòng thứ nhất cho biết các header, hay tên đại diện cho các trường thông tin: person_ID, name,..., age.
Thông thường truyền `header=None` (tệp csv không có chứa header) hoặc `header=0` (header nằm ở hàng đầu tiên).

`sep` thường là dấu `,` hoặc khoảng trắng.

In [13]:
type(people_df)

pandas.core.frame.DataFrame

Hàm `pd.read_csv` trả về một đối tượng thuộc kiểu [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html).

## 2. Xem các bản ghi đầu tiên

Sử dụng hàm `df.head` và truyền vào số bản ghi muốn xem.

Note: `df` là viết tắt của DataFrame. Viết `df.head` tức `head` là một phương thức của lớp DataFrame.

In [14]:
people_df.head(5)

   person_ID                 name  ...                title age
0       3130      Burks, Rosella   ...           Professor   41
1       3297       Avila, Damien   ...           Professor   49
2       3547        Olsen, Robin   ...  Assistant Professor  48
3       1538  Moises, Edgar Estes  ...            Professor  38
4       2941  Brian, Heath Pruitt  ...   Associate Curator   38

[5 rows x 10 columns]

## 3. Xem các bản ghi cuối cùng

Sử dụng hàm `df.tail` và truyền vào số bản ghi muốn xem.

In [15]:
people_df.tail(5)

    person_ID                name  ...                title age
35       3903        Dunlap, Ann   ...  Assistant Professor  39
36       3095  Shields, Rich Pena  ...           Professor   47
37       2383       Page, Winnie   ...              Curator  43
38       2146       Sparks, Ezra   ...  Assistant Professor  37
39       3958      Kaufman, Elba   ...            Professor  28

[5 rows x 10 columns]

## 4. Xem thông tin về số lượng bản ghi, số trường dữ liệu

In [16]:
people_df.shape

(40, 10)

In [17]:
len(people_df)

40

In [18]:
people_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 10 columns):
person_ID    40 non-null int64
name         40 non-null object
first        40 non-null object
last         40 non-null object
middle       15 non-null object
email        40 non-null object
phone        40 non-null object
fax          40 non-null object
title        40 non-null object
age          40 non-null int64
dtypes: int64(2), object(8)
memory usage: 3.2+ KB

Tệp `people.csv` lưu 40 bản ghi, mỗi bản ghi có 10 trường dữ liệu.

## 5. Truy xuất dữ liệu

Ta có thể coi `DataFrame` giống như một mảng 2 chiều. Trong đó chỉ số của hàng được đánh từ `0 1 ... N` (N là tổng số bản ghi) và chỉ số cột là các header.

**Lấy một cột:**

In [19]:
names = people_df['name']
names.head(5)

0        Burks, Rosella
1         Avila, Damien
2          Olsen, Robin
3    Moises, Edgar Estes
4    Brian, Heath Pruitt
Name: name, dtype: object

In [20]:
type(names)

pandas.core.series.Series

Một cột sẽ có kiểu dữ liệu là [Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html) - giống như mảng một chiều.

**Lấy nhiều cột:**

In [22]:
names_and_ages = people_df[['name', 'email']]
names_and_ages.head(5)

                  name             email
0      Burks, Rosella    BurksR@univ.edu
1       Avila, Damien    AvilaD@univ.edu
2        Olsen, Robin    OlsenR@univ.edu
3  Moises, Edgar Estes  MoisesE@univ.edu
4  Brian, Heath Pruitt   BrianH@univ.edu

In [23]:
type(names_and_ages)

pandas.core.frame.DataFrame

**Lấy bản ghi theo chỉ số:**

In [24]:
people_df[1:4]

   person_ID                 name  ...                title age
1       3297       Avila, Damien   ...           Professor   49
2       3547        Olsen, Robin   ...  Assistant Professor  48
3       1538  Moises, Edgar Estes  ...            Professor  38

[3 rows x 10 columns]

**Kết hợp chỉ số hàng và cột:**

In [25]:
people_df[['name', 'title']][3:6]

                  name               title
3  Moises, Edgar Estes           Professor
4  Brian, Heath Pruitt  Associate Curator
5  Claude, Elvin Haney             Curator

**Lấy bản ghi theo điều kiện:**

Tìm những người có tuổi từ 25 trở xuống:

In [26]:
young_people = people_df[people_df['age'] < 25]
young_people

    person_ID                       name  ...                title age
8        1625           Hawkins, Callie   ...            Professor  24
13       3544         Mullins, Kimberly   ...  Assistant Professor  21
17       4539            Weiss, Gilbert   ...            Professor  22
18       2811  Deirdre, Florence Barrera  ...   Associate Curator   23
20       2895         Garrison, Patrica   ...   Associate Curator   22
23       1699           Stanton, Kathie   ...            Professor  18
26       2426             Brady, Nellie   ...              Curator  23
27       2217       Katheryn, Ruben Holt  ...  Assistant Professor  22
34       2303          Quentin, Sam Hyde  ...  Assistant Professor  23

[9 rows x 10 columns]

Tìm những người là giáo sư:

In [27]:
professors = people_df[people_df['title'] == 'Professor']
professors

    person_ID                 name     first  ...           fax      title age
3        1538  Moises, Edgar Estes     Edgar  ...  963.777.8264  Professor  38
8        1625     Hawkins, Callie     Callie  ...  963.777.4949  Professor  24
9        1307        Pate, Andrea     Andrea  ...  963.777.5049  Professor  44
12       4150      Sims, Angelina   Angelina  ...  963.777.4400  Professor  49
15       1089      Payne, Ladonna    Ladonna  ...  963.777.6469  Professor  32
17       4539      Weiss, Gilbert    Gilbert  ...  963.777.4975  Professor  22
23       1699     Stanton, Kathie     Kathie  ...  963.777.1015  Professor  18
24       1567      Banks, Shannon    Shannon  ...  963.777.6979  Professor  34
30       1824        Head, Kurtis     Kurtis  ...  963.777.6348  Professor  47
39       3958       Kaufman, Elba       Elba  ...  963.777.3298  Professor  28

[10 rows x 10 columns]

**Chuyển đổi `Series` về `Numpy`:**

In [28]:
names = people_df['name'].values
print(names)
type(names)

['Burks, Rosella ' 'Avila, Damien ' 'Olsen, Robin ' 'Moises, Edgar Estes'
 'Brian, Heath Pruitt' 'Claude, Elvin Haney' 'Mosley, Edmund '
 'Derek, Antoine Mccoy' 'Hawkins, Callie ' 'Pate, Andrea ' 'Austin, Liz '
 'Kendrick, Reba Alford' 'Sims, Angelina ' 'Mullins, Kimberly '
 'Chuck, Lloyd Haney' 'Payne, Ladonna ' 'Baxter, Johnathan Browning'
 'Weiss, Gilbert ' 'Deirdre, Florence Barrera' 'Fernando, Toby Calderon'
 'Garrison, Patrica ' 'Effie, Leila Vinson' 'Buckley, Rose '
 'Stanton, Kathie ' 'Banks, Shannon ' 'Barnes, Cleo ' 'Brady, Nellie '
 'Katheryn, Ruben Holt' 'Michael, Dianne ' 'Grant, Adam ' 'Head, Kurtis '
 'Berger, Jami ' 'Earline, Jaime Fitzgerald' 'Evelyn, Summer Frost'
 'Quentin, Sam Hyde' 'Dunlap, Ann ' 'Shields, Rich Pena' 'Page, Winnie '
 'Sparks, Ezra ' 'Kaufman, Elba ']

numpy.ndarray

## 6. Thêm một cột

Nó giống như các ta thêm một key-value đối với dictionary.

Ví dụ, thêm cột năm sinh:

In [29]:
df_len = len(people_df)
birthday = 2020 - people_df['age'] 
people_df['birthday'] = birthday
people_df.tail(5)

    person_ID                name   first  ...                title age birthday
35       3903        Dunlap, Ann      Ann  ...  Assistant Professor  39     1981
36       3095  Shields, Rich Pena    Rich  ...           Professor   47     1973
37       2383       Page, Winnie   Winnie  ...              Curator  43     1977
38       2146       Sparks, Ezra     Ezra  ...  Assistant Professor  37     1983
39       3958      Kaufman, Elba     Elba  ...            Professor  28     1992

[5 rows x 11 columns]

Thêm cột `is_young` cho biết dưới hay trên 25 tuổi.

In [30]:
people_df['is_young'] = people_df['age'] < 25
people_df.head(5)

   person_ID                 name    first  ... age birthday is_young
0       3130      Burks, Rosella   Rosella  ...  41     1979    False
1       3297       Avila, Damien    Damien  ...  49     1971    False
2       3547        Olsen, Robin     Robin  ...  48     1972    False
3       1538  Moises, Edgar Estes    Edgar  ...  38     1982    False
4       2941  Brian, Heath Pruitt    Heath  ...  38     1982    False

[5 rows x 12 columns]

Thêm một cột với dữ liệu trống:

In [31]:
people_df['none_column'] = None
people_df.head(5)

   person_ID                 name    first  ... birthday is_young none_column
0       3130      Burks, Rosella   Rosella  ...     1979    False        None
1       3297       Avila, Damien    Damien  ...     1971    False        None
2       3547        Olsen, Robin     Robin  ...     1972    False        None
3       1538  Moises, Edgar Estes    Edgar  ...     1982    False        None
4       2941  Brian, Heath Pruitt    Heath  ...     1982    False        None

[5 rows x 13 columns]

## 7. Xóa cột

In [32]:
people_df.drop('none_column', axis=1, inplace=True, errors='ignore')
people_df.head(5)

   person_ID                 name    first  ... age birthday is_young
0       3130      Burks, Rosella   Rosella  ...  41     1979    False
1       3297       Avila, Damien    Damien  ...  49     1971    False
2       3547        Olsen, Robin     Robin  ...  48     1972    False
3       1538  Moises, Edgar Estes    Edgar  ...  38     1982    False
4       2941  Brian, Heath Pruitt    Heath  ...  38     1982    False

[5 rows x 12 columns]

Các tham số: 

+ tên cột 
+ axis=1 (ví lệnh drop cũng dùng để xóa hàng)
+ inplace: xóa trực tiếp trong đối tượng (`True`), hoặc tạo một bản sao và xóa trong bản sao (`False`)
+ errors: `ignore` hoặc `raise`. Nếu là `raise` sẽ tạo ra một Exception nếu không có cột yêu cầu.

## 8. Xóa bản ghi

In [33]:
people_df.drop([0, 1], axis=0, inplace=True, errors='ignore')
people_df.head(5)

   person_ID                 name   first  ... age birthday is_young
2       3547        Olsen, Robin    Robin  ...  48     1972    False
3       1538  Moises, Edgar Estes   Edgar  ...  38     1982    False
4       2941  Brian, Heath Pruitt   Heath  ...  38     1982    False
5       2401  Claude, Elvin Haney   Elvin  ...  41     1979    False
6       2070      Mosley, Edmund   Edmund  ...  33     1987    False

[5 rows x 12 columns]

Tương tự xóa cột, xóa bản ghi hay xóa hàng cần truyền vào chỉ số bản ghi và `axis=0`.

## 9. Lưu DataFrame thành tệp csv

In [0]:
people_df.to_csv('people.csv', encoding='utf-8', header=0, sep=',')

Các tham số giống với hàm `pd.read_csv`.